NordicPlayground/nrf52-gtt-demos/05_ble_led_sensor/nrf_drv_twi_dma.c
    p_cb->error   = false;

    ret_code_t ret_code = NRF_SUCCESS;

    CODE_FOR_TWIM
    (
        NRF_TWIM_Type * p_twim = (NRF_TWIM_Type *)p_reg;

        if (!p_cb->handler)
        {
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_STOPPED);
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
            nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
        }

        nrf_twim_address_set(p_twim, address);
        if (tx)
        {
            if (!is_linked)
            {
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
                nrf_twim_tx_buffer_set(p_twim, p_data, length);

                nrf_twim_shorts_set(p_twim, (no_stop) ? NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK :
                        NRF_TWIM_SHORT_LASTTX_STOP_MASK);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTTX);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);

            }
            else
            {
                if (p_cb->xfer.tx)
                {
                    while(!nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_TXSTARTED));
                }
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_TXSTARTED);
                nrf_twim_tx_buffer_set(p_twim, p_data, length);
            }

            p_cb->int_mask = (p_cb->xfer.no_stop) ? NRF_TWIM_INT_LASTTX_MASK | NRF_TWIM_INT_ERROR_MASK:
                                             NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;

        }
        else
        {
            if (!is_linked)
            {
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_RXSTARTED);
                nrf_twim_rx_buffer_set(p_twim, (uint8_t *)p_data, length);
                nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTRX_STOP_MASK);

                p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK | NRF_TWIM_INT_ERROR_MASK;
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTRX);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
            }
            else
            {
                //if previous transfer was rx pend until it's started.
                if (!p_cb->xfer.tx)
                {
                    while(!nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_RXSTARTED));
                }
                nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_RXSTARTED);
                nrf_twim_rx_buffer_set(p_twim, (uint8_t *)p_data, length);

                if (p_cb->xfer.no_stop)
                {
                    p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK |
                               NRF_TWIM_INT_ERROR_MASK   |
                               NRF_TWIM_INT_LASTTX_MASK;
                    nrf_twim_shorts_enable(p_twim, NRF_TWIM_SHORT_LASTTX_STARTRX_MASK |
                                                   NRF_TWIM_SHORT_LASTRX_STOP_MASK);
                    if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_LASTTX))
                    {
                        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
                        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
                        nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTRX);
                    }
                    nrf_twim_shorts_disable(p_twim, NRF_TWIM_SHORT_LASTTX_SUSPEND_MASK);
                }
                else
                {
                    p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK |
                               NRF_TWIM_INT_ERROR_MASK;
                }
            }
        }

        // In case TWI is suspended resume its operation.
       // nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);


        if (p_cb->handler)
        {
            nrf_twim_int_enable(p_twim, p_cb->int_mask);
        }
        else
        {
            nrf_twim_event_t event = (no_stop) ? NRF_TWIM_EVENT_LASTTX : NRF_TWIM_EVENT_STOPPED;

            while (!nrf_twim_event_check(p_twim, event))
            {
                if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_ERROR))
                {
                    nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
                    nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STOP);
                    event = NRF_TWIM_EVENT_STOPPED;
                }
            }

            uint32_t errorsrc =  nrf_twim_errorsrc_get_and_clear(p_twim);

            p_cb->xfer.p_data = NULL;

            if (errorsrc)
            {
                return NRF_ERROR_INTERNAL;
            }
        }
    )
    CODE_FOR_TWI
    (
        NRF_TWI_Type * p_twi = (NRF_TWI_Type *)p_reg;
        if (!is_linked)
        {


            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_STOPPED);
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_ERROR);
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_TXDSENT);
            nrf_twi_event_clear(p_twi, NRF_TWI_EVENT_RXDREADY);
            nrf_twi_shorts_set(p_twi, 0);

            p_cb->bytes_transferred = 0;

            nrf_twi_address_set(p_twi, address);

            // In case TWI is suspended resume its operation.
            nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_RESUME);

            if (tx)
            {
                nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTTX);
                twi_send_byte(p_twi, p_cb);
            }
            else
            {
                nrf_twi_task_trigger(p_twi, NRF_TWI_TASK_STARTRX);
                if (p_cb->xfer.length == 1 && !p_cb->xfer.no_stop)
                {
                    nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_STOP_MASK);
                }
                else
                {
                    nrf_twi_shorts_set(p_twi, NRF_TWI_SHORT_BB_SUSPEND_MASK);
                }
            }

            if (p_cb->handler)
            {
                p_cb->int_mask = NRF_TWI_INT_STOPPED_MASK   |
                                NRF_TWI_INT_ERROR_MASK     |
                                NRF_TWI_INT_TXDSENT_MASK   |
                                NRF_TWI_INT_RXDREADY_MASK;
                nrf_twi_int_enable(p_twi, p_cb->int_mask);
            }
            else
            {
                while (twi_transfer(p_twi, p_cb))
                {}

                if (p_cb->error)
                {
                    //uint32_t errorsrc = nrf_twi_errorsrc_get_and_clear(p_twi);
                    ret_code = NRF_ERROR_INTERNAL;
                }

                p_cb->xfer.p_data = NULL;
            }
        }
        else
        {
            p_cb->int_mask = NRF_TWI_INT_STOPPED_MASK   |
                            NRF_TWI_INT_ERROR_MASK     |
                            NRF_TWI_INT_TXDSENT_MASK   |
                            NRF_TWI_INT_RXDREADY_MASK;
            nrf_twi_int_enable(p_twi, p_cb->int_mask);
        }
    )

    return ret_code;
}

ret_code_t nrf_drv_twi_tx(nrf_drv_twi_t const * p_instance,
                          uint8_t               address,
                          uint8_t const *       p_data,
                          uint8_t               length,
                          bool                  no_stop)
{
    return start_transfer(&m_cb[p_instance->drv_inst_idx], p_instance->p_reg, address, p_data, length, no_stop, true);
}

ret_code_t nrf_drv_twi_rx(nrf_drv_twi_t const * p_instance,
                          uint8_t               address,
                          uint8_t *             p_data,
                          uint8_t               length,
                          bool                  no_stop)
{
    return start_transfer(&m_cb[p_instance->drv_inst_idx], p_instance->p_reg, address, p_data, length, no_stop, false);
}

#ifdef TWIM_IN_USE
static void irq_handler_twim(NRF_TWIM_Type * p_twim, twi_control_block_t * p_cb)
{
    ASSERT(p_cb->handler);

    if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_ERROR))
    {
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_ERROR);
        if (!nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_STOPPED))
        {
            p_cb->int_mask &= ~(NRF_TWIM_INT_ERROR_MASK | NRF_TWIM_INT_LASTTX_MASK);
            nrf_twim_int_disable(p_twim, NRF_TWIM_INT_ERROR_MASK |
                                         NRF_TWIM_INT_LASTTX_MASK);
            nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
            nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STOP);
            return;
        }
    }

