NordicPlayground/nrf52-gtt-demos/05_ble_led_sensor/nrf_drv_twi_dma.c
    nrf_drv_twi_evt_t event;
    event.p_data = p_cb->xfer.p_data;

    if (nrf_twim_event_check(p_twim, NRF_TWIM_EVENT_STOPPED))
    {
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_STOPPED);
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTRX);
        nrf_twim_shorts_set(p_twim, 0);

        event.length = p_cb->xfer.tx ? nrf_twim_txd_amount_get(p_twim)
                                : nrf_twim_rxd_amount_get(p_twim);
        p_cb->xfer.p_data = NULL;
        if (p_cb->next_xfer.p_data)
        {
            uint8_t * p_data = p_cb->next_xfer.p_data;
            p_cb->next_xfer.p_data = NULL;

            (void)start_transfer(p_cb, p_twim, p_cb->next_xfer.address, p_data, p_cb->next_xfer.length,
                                 p_cb->next_xfer.no_stop, p_cb->next_xfer.tx);
        }

    }
    else
    {
        nrf_twim_event_clear(p_twim, NRF_TWIM_EVENT_LASTTX);
        if (!p_cb->xfer.no_stop)
        {
            return;
        }
        event.length = p_cb->xfer.length;

        p_cb->xfer = p_cb->next_xfer;
        if (p_cb->xfer.p_data)
        {
            p_cb->next_xfer.p_data = NULL;
            if (p_cb->xfer.tx)
            {
                if (!p_cb->xfer.no_stop)
                {
                    nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTTX_STOP_MASK);
                    p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK;
                    nrf_twim_int_disable(p_twim, DISABLE_ALL);
                    nrf_twim_int_enable(p_twim, NRF_TWIM_INT_STOPPED_MASK);
                }
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_RESUME);
                nrf_twim_task_trigger(p_twim, NRF_TWIM_TASK_STARTTX);
            }
            else
            {
                nrf_twim_shorts_set(p_twim, NRF_TWIM_SHORT_LASTRX_STOP_MASK);
                p_cb->int_mask = NRF_TWIM_INT_STOPPED_MASK;
                nrf_twim_int_disable(p_twim, DISABLE_ALL);
                nrf_twim_int_enable(p_twim, NRF_TWIM_INT_STOPPED_MASK);
            }
        }
        else
        {
            p_cb->int_mask = 0;
            nrf_twim_int_disable(p_twim, DISABLE_ALL);
        }
    }

    uint32_t errorsrc = nrf_twim_errorsrc_get_and_clear(p_twim);
    if (errorsrc & NRF_TWIM_ERROR_ADDRESS_NACK)
    {
        event.type = NRF_DRV_TWI_EVENT_ADDRESS_NACK;
    }
    else if (errorsrc & NRF_TWIM_ERROR_DATA_NACK)
    {
        event.type = NRF_DRV_TWI_EVENT_DATA_NACK;
    }
    else
    {
        event.type = NRF_DRV_TWI_EVENT_DONE;
    }

    p_cb->handler(&event, p_cb->p_context);
}
#endif // TWIM_IN_USE

#ifdef TWI_IN_USE
static void irq_handler_twi(NRF_TWI_Type * p_twi, twi_control_block_t * p_cb)
{
    ASSERT(p_cb->handler);

    if (twi_transfer(p_twi, p_cb))
    {
        return;
    }

    nrf_drv_twi_evt_t event;
    event.p_data = p_cb->xfer.p_data;
    event.length = p_cb->bytes_transferred;

    if (p_cb->error)
    {
        uint32_t errorsrc = nrf_twi_errorsrc_get_and_clear(p_twi);
        if (errorsrc & NRF_TWI_ERROR_ADDRESS_NACK)
        {
            event.type = NRF_DRV_TWI_EVENT_ADDRESS_NACK;
        }
        else if (errorsrc & NRF_TWI_ERROR_DATA_NACK)
        {
            event.type = NRF_DRV_TWI_EVENT_DATA_NACK;
        }
    }
    else
    {
        event.type = NRF_DRV_TWI_EVENT_DONE;
    }

    /* if linked transfer present schedule it.
     * Would be good to wrap it around critical section since now it can be interrupted by API called
     * from higher level interrupt. */
    p_cb->xfer.p_data = NULL;
    if (p_cb->next_xfer.p_data)
    {
        uint8_t * p_data = p_cb->next_xfer.p_data;
        p_cb->next_xfer.p_data = NULL;
        (void)start_transfer(p_cb, p_twi, p_cb->next_xfer.address, p_data, p_cb->next_xfer.length,
                             p_cb->next_xfer.no_stop, p_cb->next_xfer.tx);
    }
    p_cb->handler(&event, p_cb->p_context);
}
#endif // TWI_IN_USE

#if (TWI0_ENABLED == 1)
void TWI0_IRQ_HANDLER(void)
{
    #if (TWI0_USE_EASY_DMA == 1) && defined(NRF52)
        irq_handler_twim(NRF_TWIM0,
    #else
        irq_handler_twi(NRF_TWI0,
    #endif
            &m_cb[TWI0_INSTANCE_INDEX]);
}
#endif // (TWI0_ENABLED == 1)

#if (TWI1_ENABLED == 1)
void TWI1_IRQ_HANDLER(void)
{
    #if (TWI1_USE_EASY_DMA == 1)
        irq_handler_twim(NRF_TWIM1,
    #else
        irq_handler_twi(NRF_TWI1,
    #endif
            &m_cb[TWI1_INSTANCE_INDEX]);
}
#endif // (SPI1_ENABLED == 1)
